Repository: PavelGld/MaterialMaster
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Material Selection Analysis
ru: Анализ выбора материалов

source: AI Material Selection
ru: ИИ подбор материалов

source: About
ru: О системе

source: AI-powered material selection system for engineering applications
ru: Система подбора материалов на основе ИИ для инженерных приложений

source: Material Analysis System
ru: Система анализа материалов

source: Upload technical drawings or provide descriptions for AI-powered material recommendations
ru: Загрузите технические чертежи или предоставьте описания для рекомендаций материалов на основе ИИ

source: Input Data
ru: Входные данные

source: Technical Description
ru: Техническое описание

source: Describe the component, its purpose, operating conditions, and requirements...
ru: Опишите компонент, его назначение, условия эксплуатации и требования...

source: Provide detailed information about the component including dimensions, operating temperature, loads, environment, etc.
ru: Предоставьте подробную информацию о компоненте, включая размеры, рабочую температуру, нагрузки, окружающую среду и т.д.

source: Technical Drawing
ru: Технический чертеж

source: Upload PNG or JPEG images. OCR will extract text from technical drawings.
ru: Загрузите изображения PNG или JPEG. OCR извлечет текст из технических чертежей.

source: Note:
ru: Примечание:

source: You can provide either a text description, upload a drawing, or both. The system will analyze all available information to provide comprehensive material recommendations.
ru: Вы можете предоставить текстовое описание, загрузить чертеж или и то, и другое. Система проанализирует всю доступную информацию для предоставления комплексных рекомендаций по материалам.

source: Analyze Materials
ru: Анализировать материалы

source: OCR Processing
ru: OCR обработка

source: Extract text from technical drawings using advanced OCR technology
ru: Извлечение текста из технических чертежей с использованием передовой технологии OCR

source: AI Analysis
ru: ИИ анализ

source: Powered by Google Gemini for intelligent material recommendations
ru: На основе Google Gemini для интеллектуальных рекомендаций материалов

source: PDF Reports
ru: PDF отчеты

source: Generate professional PDF reports with detailed analysis
ru: Создание профессиональных PDF отчетов с подробным анализом

source: 1. Product Purpose and Operating Conditions Assessment
ru: 1. Оценка назначения изделия и условий эксплуатации

source: 2. Material Selection and Justification
ru: 2. Выбор и обоснование материала

source: 3. Manufacturing Technology and Processing
ru: 3. Технология изготовления и обработки

source: 4. Structural Characteristics and Design
ru: 4. Конструктивные характеристики и проектирование

source: 5. Defect Analysis and Quality Control
ru: 5. Анализ дефектов и контроль качества

source: 6. Material Properties Testing Methods
ru: 6. Методы испытаний свойств материала

source: Purpose
ru: Назначение

source: Operating Conditions
ru: Условия эксплуатации

source: Critical Requirements
ru: Критические требования

source: Primary Material
ru: Основной материал

source: Alternative Materials
ru: Альтернативные материалы

source: Justification
ru: Обоснование

source: Manufacturing Process
ru: Технологический процесс

source: Processing Parameters
ru: Параметры обработки

source: Quality Control Steps
ru: Этапы контроля качества

source: Design Features
ru: Конструктивные особенности

source: Dimensional Requirements
ru: Размерные требования

source: Surface Requirements
ru: Требования к поверхности

source: Common Defects
ru: Типичные дефекты

source: Causes
ru: Причины

source: Prevention Methods
ru: Методы предотвращения

source: Correction Methods
ru: Методы исправления

source: Mechanical Tests
ru: Механические испытания

source: Non-Destructive Tests
ru: Неразрушающие испытания

source: Standards
ru: Стандарты

source: Acceptance Criteria
ru: Критерии приемки

source: Recommended Materials
ru: Рекомендуемые материалы

source: Primary Choice
ru: Основной выбор

source: GOST Standards
ru: Стандарты ГОСТ

source: Processing Methods
ru: Методы обработки

source: Heat Treatment
ru: Термическая обработка

source: Surface Treatment
ru: Обработка поверхности

source: 4. Material Structure Characteristics
ru: 4. Структурные характеристики материала

source: Microstructure
ru: Микроструктура

source: Mechanical Properties
ru: Механические свойства

source: 5. Defect Analysis and Prevention
ru: 5. Анализ дефектов и предотвращение

source: Testing Standards
ru: Стандарты испытаний

source: No analysis results available.
ru: Результаты анализа недоступны.

source: Download PDF Report
ru: Скачать PDF отчет

source: New Analysis
ru: Новый анализ

source: Analysis Report Sections
ru: Разделы аналитического отчета

source: Product Purpose Assessment
ru: Оценка назначения продукта

source: Material Selection & Justification
ru: Выбор материала и обоснование

source: Manufacturing Technology
ru: Технология производства

source: Structural Characteristics
ru: Структурные характеристики

source: Defect Analysis & Prevention
ru: Анализ дефектов и предотвращение

source: Testing Methods & Standards
ru: Методы испытаний и стандарты

source: Please provide either a text description or upload a drawing.
ru: Пожалуйста, предоставьте текстовое описание или загрузите чертеж.

source: Text successfully extracted from drawing.
ru: Текст успешно извлечен из чертежа.

source: No text could be extracted from the drawing.
ru: Из чертежа не удалось извлечь текст.

source: Invalid file format. Please upload PNG or JPEG files only.
ru: Неверный формат файла. Пожалуйста, загружайте только файлы PNG или JPEG.

source: No text available for analysis.
ru: Нет текста для анализа.

source: Failed to generate material analysis. Please try again.
ru: Не удалось сгенерировать анализ материала. Пожалуйста, попробуйте еще раз.

source: No analysis available for PDF generation.
ru: Нет анализа для создания PDF.

source: File size must be less than 16MB
ru: Размер файла должен быть менее 16МБ

source: Please upload PNG or JPEG files only
ru: Пожалуйста, загружайте только файлы PNG или JPEG

source: Please provide either a text description or upload a drawing
ru: Пожалуйста, предоставьте текстовое описание или загрузите чертеж

source: Processing...
ru: Обработка...

source: Page Not Found
ru: Страница не найдена

source: The page you are looking for does not exist.
ru: Страница, которую вы ищете, не существует.

source: Return to Home
ru: Вернуться на главную

source: Internal Server Error
ru: Внутренняя ошибка сервера

source: Something went wrong on our end. Please try again later.
ru: Что-то пошло не так с нашей стороны. Пожалуйста, попробуйте позже.

source: Analysis Results
ru: Результаты анализа

source: Material Analysis Results
ru: Результаты анализа материалов

source: Download PDF
ru: Скачать PDF

source: Input Data Summary
ru: Сводка входных данных

source: OCR Extracted
ru: Извлечено OCR
